tap "anomalyco/tap"
tap "hashicorp/tap"
tap "steipete/tap"
brew "aqua"
brew "aws-vault"
brew "python@3.13"
brew "awscli"
brew "bash-completion"
brew "bats-core"
brew "chezmoi"
brew "direnv"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "go-task"
brew "neovim"
brew "node"
brew "peco"
brew "pnpm"
brew "poetry"
brew "postgresql@14"
brew "python@3.11"
brew "python@3.12"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "volta"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "hashicorp/tap/terraform"
brew "steipete/tap/gogcli"
cask "1password-cli"
cask "codex"
cask "dbeaver-community"
cask "figma"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "rancher"
cask "raycast"
cask "visual-studio-code"
cask "warp"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-html"
vscode "bierner.markdown-mermaid"
vscode "bigonesystems.django"
vscode "bradlc.vscode-tailwindcss"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dariofuzinato.vue-peek"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-docker-syntax"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "henriiik.docker-linter"
vscode "hollowtree.vue-pack"
vscode "hollowtree.vue-snippets"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loiane.ts-extension-pack"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meta.pyrefly"
vscode "mhutchie.git-graph"
vscode "misterj.vue-volar-extention-pack"
vscode "monosans.djlint"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pdconsec.vscode-print"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "prisma.prisma"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samghelms.jupyter-notebook-vscode"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidthesloth.html5-boilerplate"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "syler.sass-indented"
vscode "taizod1024.ac-ts-extension"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yossuli.django-html-completioner"
vscode "yseop.vscode-yseopml"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
