tap "homebrew/bundle"
brew "python@3.12"
brew "awscli"
brew "bash-completion"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "graphviz"
brew "hugo"
brew "neovim"
brew "node"
brew "peco"
brew "pnpm"
brew "python@3.13"
brew "poetry"
brew "postgresql@13"
brew "python@3.11"
brew "python@3.8"
brew "rye"
brew "tree"
brew "uv"
brew "vim"
brew "volta"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
cask "background-music"
cask "dbeaver-community"
cask "docker"
cask "figma"
cask "google-chrome"
cask "iterm2"
cask "raycast"
cask "visual-studio-code"
cask "warp"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-html"
vscode "bierner.markdown-mermaid"
vscode "bigonesystems.django"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dariofuzinato.vue-peek"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-docker-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "gregorbiswanger.json2ts"
vscode "hbenl.vscode-test-explorer"
vscode "henriiik.docker-linter"
vscode "hollowtree.vue-pack"
vscode "hollowtree.vue-snippets"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loiane.ts-extension-pack"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "misterj.vue-volar-extention-pack"
vscode "monosans.djlint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pdconsec.vscode-print"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "samghelms.jupyter-notebook-vscode"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidthesloth.html5-boilerplate"
vscode "silasnevstad.gpthelper"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "stuartelimu.django-template-snippets"
vscode "syler.sass-indented"
vscode "takumii.markdowntable"
vscode "thebarkman.vscode-djaneiro"
vscode "tis.promptis"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yossuli.django-html-completioner"
vscode "yseop.vscode-yseopml"
vscode "yzhang.markdown-all-in-one"
