tap "homebrew/bundle"
brew "awscli"
brew "bash-completion"
brew "fzf"
brew "gh"
brew "git"
brew "peco"
brew "python@3.12"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
cask "docker"
cask "visual-studio-code"
vscode "adpyke.vscode-sql-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-html"
vscode "bigonesystems.django"
vscode "cameron.vscode-pytest"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codesandbox-io.codesandbox-projects"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-docker-syntax"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.heygithub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "gregorbiswanger.json2ts"
vscode "hbenl.vscode-test-explorer"
vscode "henriiik.docker-linter"
vscode "hollowtree.vue-pack"
vscode "hollowtree.vue-snippets"
vscode "jebbs.plantuml"
vscode "kevinglasson.cornflakes-linter"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loiane.ts-extension-pack"
vscode "matangover.mypy"
vscode "mebrahtom.plantumlpreviewer"
vscode "mhutchie.git-graph"
vscode "misterj.vue-volar-extention-pack"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "reditorsupport.r"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samghelms.jupyter-notebook-vscode"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidthesloth.html5-boilerplate"
vscode "silasnevstad.gpthelper"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "stuartelimu.django-template-snippets"
vscode "swellaby.rust-pack"
vscode "syler.sass-indented"
vscode "tabnine.tabnine-vscode"
vscode "taizod1024.ac-ts-extension"
vscode "tamasfe.even-better-toml"
vscode "thebarkman.vscode-djaneiro"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yossuli.django-html-completioner"
vscode "yzhang.markdown-all-in-one"
